Show / Hide Table of Contents
Class Vector2D
Represents a vector in two-dimensional space.
Inheritance
System.Object
OpenObject
Vector2D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("System.Windows.Vector, WindowsBase")]
public class Vector2D : OpenObject
Properties
Improve this Doc   View Source
X
Gets or sets the X-dirrection value
Declaration
public double X { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y
Gets or sets the Y-dirrection value
Declaration
public double Y { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source